apache/nuttx/arch/arm/src/stm32f0/chip/stm32f0_dma.h
/************************************************************************************
 * arch/arm/src/stm32f0/chip/stm32f0_dma.h
 *
 *   Copyright (C) 2017 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32F0_CHIP_STM32F0_DMA_H
#define __ARCH_ARM_SRC_STM32F0_CHIP_STM32F0_DMA_H

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/
/* 12 Channels Total: 7 DMA1 Channels(1-7) (and 5 DMA2 channels (1-5) if STM32F09x) */

#define DMA1 0
#define DMA2 1
#define DMA3 2
#define DMA4 3
#define DMA5 4
#define DMA6 5
#define DMA7 6

/* Register Offsets *****************************************************************/

#define STM32F0_DMA_ISR_OFFSET       0x0000 /* DMA interrupt status register */
#define STM32F0_DMA_IFCR_OFFSET      0x0004 /* DMA interrupt flag clear register */

#define STM32F0_DMACHAN_OFFSET(n)    (0x0014*(n))
#define STM32F0_DMACHAN1_OFFSET      0x0000
#define STM32F0_DMACHAN2_OFFSET      0x0014
#define STM32F0_DMACHAN3_OFFSET      0x0028
#define STM32F0_DMACHAN4_OFFSET      0x003c
#define STM32F0_DMACHAN5_OFFSET      0x0050
#define STM32F0_DMACHAN6_OFFSET      0x0064
#define STM32F0_DMACHAN7_OFFSET      0x0078

#define STM32F0_DMACHAN_CCR_OFFSET   0x0008 /* DMA channel configuration register */
#define STM32F0_DMACHAN_CNDTR_OFFSET 0x000c /* DMA channel number of data register */
#define STM32F0_DMACHAN_CPAR_OFFSET  0x0010 /* DMA channel peripheral address register */
#define STM32F0_DMACHAN_CMAR_OFFSET  0x0014 /* DMA channel memory address register */

#define STM32F0_DMA_CCR_OFFSET(n)   (STM32F0_DMACHAN_CCR_OFFSET+STM32F0_DMACHAN_OFFSET(n))
#define STM32F0_DMA_CNDTR_OFFSET(n) (STM32F0_DMACHAN_CNDTR_OFFSET+STM32F0_DMACHAN_OFFSET(n))
#define STM32F0_DMA_CPAR_OFFSET(n)  (STM32F0_DMACHAN_CPAR_OFFSET+STM32F0_DMACHAN_OFFSET(n))
#define STM32F0_DMA_CMAR_OFFSET(n)  (STM32F0_DMACHAN_CMAR_OFFSET+STM32F0_DMACHAN_OFFSET(n))

#define STM32F0_DMA_CCR1_OFFSET     0x0008 /* DMA channel 1 configuration register */
#define STM32F0_DMA_CCR2_OFFSET     0x001c /* DMA channel 2 configuration register */
#define STM32F0_DMA_CCR3_OFFSET     0x0030 /* DMA channel 3 configuration register */
#define STM32F0_DMA_CCR4_OFFSET     0x0044 /* DMA channel 4 configuration register */
#define STM32F0_DMA_CCR5_OFFSET     0x0058 /* DMA channel 5 configuration register */
#define STM32F0_DMA_CCR6_OFFSET     0x006c /* DMA channel 6 configuration register */
#define STM32F0_DMA_CCR7_OFFSET     0x0080 /* DMA channel 7 configuration register */

#define STM32F0_DMA_CNDTR1_OFFSET   0x000c /* DMA channel 1 number of data register */
#define STM32F0_DMA_CNDTR2_OFFSET   0x0020 /* DMA channel 2 number of data register */
#define STM32F0_DMA_CNDTR3_OFFSET   0x0034 /* DMA channel 3 number of data register */
#define STM32F0_DMA_CNDTR4_OFFSET   0x0048 /* DMA channel 4 number of data register */
#define STM32F0_DMA_CNDTR5_OFFSET   0x005c /* DMA channel 5 number of data register */
#define STM32F0_DMA_CNDTR6_OFFSET   0x0070 /* DMA channel 6 number of data register */
#define STM32F0_DMA_CNDTR7_OFFSET   0x0084 /* DMA channel 7 number of data register */

#define STM32F0_DMA_CPAR1_OFFSET    0x0010 /* DMA channel 1 peripheral address register */
#define STM32F0_DMA_CPAR2_OFFSET    0x0024 /* DMA channel 2 peripheral address register */
#define STM32F0_DMA_CPAR3_OFFSET    0x0038 /* DMA channel 3 peripheral address register */
#define STM32F0_DMA_CPAR4_OFFSET    0x004c /* DMA channel 4 peripheral address register */
#define STM32F0_DMA_CPAR5_OFFSET    0x0060 /* DMA channel 5 peripheral address register */
#define STM32F0_DMA_CPAR6_OFFSET    0x0074 /* DMA channel 6 peripheral address register */
#define STM32F0_DMA_CPAR7_OFFSET    0x0088 /* DMA channel 7 peripheral address register */

#define STM32F0_DMA_CMAR1_OFFSET    0x0014 /* DMA channel 1 memory address register */
#define STM32F0_DMA_CMAR2_OFFSET    0x0028 /* DMA channel 2 memory address register */
#define STM32F0_DMA_CMAR3_OFFSET    0x003c /* DMA channel 3 memory address register */
#define STM32F0_DMA_CMAR4_OFFSET    0x0050 /* DMA channel 4 memory address register */
#define STM32F0_DMA_CMAR5_OFFSET    0x0064 /* DMA channel 5 memory address register */
#define STM32F0_DMA_CMAR6_OFFSET    0x0078 /* DMA channel 6 memory address register */
#define STM32F0_DMA_CMAR7_OFFSET    0x008c /* DMA channel 7 memory address register */

#define STM32F0_DMA_CSELR_OFFSET    0x00a8 /* DMA channel selection register */

/* Register Addresses ***************************************************************/

#define STM32F0_DMA1_ISRC           (STM32F0_DMA1_BASE+STM32F0_DMA_ISR_OFFSET)
#define STM32F0_DMA1_IFCR           (STM32F0_DMA1_BASE+STM32F0_DMA_IFCR_OFFSET)

#define STM32F0_DMA1_CCR(n)         (STM32F0_DMA1_BASE+STM32F0_DMA_CCR_OFFSET(n))
#define STM32F0_DMA1_CCR1           (STM32F0_DMA1_BASE+STM32F0_DMA_CCR1_OFFSET)
#define STM32F0_DMA1_CCR2           (STM32F0_DMA1_BASE+STM32F0_DMA_CCR2_OFFSET)
#define STM32F0_DMA1_CCR3           (STM32F0_DMA1_BASE+STM32F0_DMA_CCR3_OFFSET)
#define STM32F0_DMA1_CCR4           (STM32F0_DMA1_BASE+STM32F0_DMA_CCR4_OFFSET)
#define STM32F0_DMA1_CCR5           (STM32F0_DMA1_BASE+STM32F0_DMA_CCR5_OFFSET)
#define STM32F0_DMA1_CCR6           (STM32F0_DMA1_BASE+STM32F0_DMA_CCR6_OFFSET)
#define STM32F0_DMA1_CCR7           (STM32F0_DMA1_BASE+STM32F0_DMA_CCR7_OFFSET)

#define STM32F0_DMA1_CNDTR(n)       (STM32F0_DMA1_BASE+STM32F0_DMA_CNDTR_OFFSET(n))
#define STM32F0_DMA1_CNDTR1         (STM32F0_DMA1_BASE+STM32F0_DMA_CNDTR1_OFFSET)
#define STM32F0_DMA1_CNDTR2         (STM32F0_DMA1_BASE+STM32F0_DMA_CNDTR2_OFFSET)
#define STM32F0_DMA1_CNDTR3         (STM32F0_DMA1_BASE+STM32F0_DMA_CNDTR3_OFFSET)
#define STM32F0_DMA1_CNDTR4         (STM32F0_DMA1_BASE+STM32F0_DMA_CNDTR4_OFFSET)
#define STM32F0_DMA1_CNDTR5         (STM32F0_DMA1_BASE+STM32F0_DMA_CNDTR5_OFFSET)
#define STM32F0_DMA1_CNDTR6         (STM32F0_DMA1_BASE+STM32F0_DMA_CNDTR6_OFFSET)
#define STM32F0_DMA1_CNDTR7         (STM32F0_DMA1_BASE+STM32F0_DMA_CNDTR7_OFFSET)

#define STM32F0_DMA1_CPAR(n)        (STM32F0_DMA1_BASE+STM32F0_DMA_CPAR_OFFSET(n))
#define STM32F0_DMA1_CPAR1          (STM32F0_DMA1_BASE+STM32F0_DMA_CPAR1_OFFSET)
#define STM32F0_DMA1_CPAR2          (STM32F0_DMA1_BASE+STM32F0_DMA_CPAR2_OFFSET)
#define STM32F0_DMA1_CPAR3          (STM32F0_DMA1_BASE+STM32F0_DMA_CPAR3_OFFSET)
#define STM32F0_DMA1_CPAR4          (STM32F0_DMA1_BASE+STM32F0_DMA_CPAR4_OFFSET)
#define STM32F0_DMA1_CPAR5          (STM32F0_DMA1_BASE+STM32F0_DMA_CPAR5_OFFSET)
#define STM32F0_DMA1_CPAR6          (STM32F0_DMA1_BASE+STM32F0_DMA_CPAR6_OFFSET)
#define STM32F0_DMA1_CPAR7          (STM32F0_DMA1_BASE+STM32F0_DMA_CPAR7_OFFSET)

#define STM32F0_DMA1_CMAR(n)        (STM32F0_DMA1_BASE+STM32F0_DMA_CMAR_OFFSET(n))
#define STM32F0_DMA1_CMAR1          (STM32F0_DMA1_BASE+STM32F0_DMA_CMAR1_OFFSET)
#define STM32F0_DMA1_CMAR2          (STM32F0_DMA1_BASE+STM32F0_DMA_CMAR2_OFFSET)
#define STM32F0_DMA1_CMAR3          (STM32F0_DMA1_BASE+STM32F0_DMA_CMAR3_OFFSET)
#define STM32F0_DMA1_CMAR4          (STM32F0_DMA1_BASE+STM32F0_DMA_CMAR4_OFFSET)
#define STM32F0_DMA1_CMAR5          (STM32F0_DMA1_BASE+STM32F0_DMA_CMAR5_OFFSET)
#define STM32F0_DMA1_CMAR6          (STM32F0_DMA1_BASE+STM32F0_DMA_CMAR6_OFFSET)
#define STM32F0_DMA1_CMAR7          (STM32F0_DMA1_BASE+STM32F0_DMA_CMAR7_OFFSET)

